{"release_date":"23\/02\/2024","title":"Half of adults sentenced to provincial correctional programs were reconvicted within three years, mostly for non-violent offences","url":"https:\/\/www150.statcan.gc.ca\/daily-quotidien\/240223\/dq240223b-eng.htm","date_retrieved":"23\/02\/2024","summary":"In 2015\/2016, half of the adults released from custody or starting community supervision across five Canadian provinces were reconvicted within three years. The reconviction rate was higher for those with custodial sentences (66%) compared to community supervision (40%). The study found that reconvictions were mostly for non-violent offenses, with administration of justice offenses being the most common. Young men aged 18 to 34 had the highest reconviction rates. Indigenous individuals were more likely to be reconvicted than non-Indigenous, with a 30% higher likelihood on average. The study also found that Black individuals had a similar reconviction rate to White individuals, with an 8% lower risk when adjusted for various factors. Factors contributing to over-representation in the criminal justice system, such as historical and systemic issues, were not analyzed in this study.","quotes":["'Half of adults sentenced to custody or community supervision were reconvicted within three years","The risk of reconviction was highest in the first three months","Young men had the highest incidence of reconviction","Most of those in the cohort with 10 or more prior convictions were reconvicted within three years","Indigenous people in the cohort were more likely to be reconvicted than non-Indigenous people","Breaking the cycle of administration of justice convictions could help reduce the gap in reconvictions between Indigenous and non-Indigenous people","Nearly the same proportion of Black people were reconvicted as White people'"],"institution":"statistics canada","file_1":"Justice and Attorney General of Canada","file_2":"Public Safety","file_advisor_1":"S. Phelan","file_advisor_2":"Y. Zhu","news_bool":false}